In [1]:
import pandas as pd
import numpy as np
exam_data  = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

Q-1:Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [2]:
df = pd.DataFrame(exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Q-2:Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

Q-3:Write a Pandas program to get the first 3 rows of a given DataFrame

In [4]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Q-4:Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame

In [5]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Q-5:Select name and score columns in rows 1, 3, 5, 6 from the following data frame.

In [6]:
df.iloc[[1,3,5,6],[1,2,3]]

   score  attempts qualify
b    9.0         3      no
d    NaN         3      no
f   20.0         3     yes
g   14.5         1     yes

Q-6:Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [7]:
df[df['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Q-7: Write a Pandas program to count the number of rows and columns of a DataFrame.

In [8]:
raw = len(df.axes[0])
col = len(df.axes[1])
print(raw,col)

10 4

Q-8:Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [9]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

Q-9:Write a Pandas program to select the rows the score is between 15 and 20

In [10]:
df[df['score'].between(15,20) ]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Q-10:Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [11]:
df[(df['attempts'] < 2) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes